import Route from '@ember/routing/route';

export default Route.extend({
    model() {
        return [{
                "id": "thisisevaluationid",
                "component_data": [{
                    "key": "evaluation-title-card",
                    "values": {
                        "title": "战略规划",
                        "content": "掌握信息是降低风险的关键要素，对信息的理解越深，决策出错的可能性就越低，在执行前，我们需要透过科学化的客观分析，把握外部环境变化、洞察问题，并发现其对市场、公司的影响，借而发现市场机会、客户发展发方向、预测市场发展趋势，综合多方因素进行科学、客观的区域业务计划，这是完美达成任务的关键第一步。"
                    }
                }, {
                    "key": "ability-card",
                    "values": [{
                        "title": "报表分析与决策",
                        "level": "B",
                        "desc": [
                            { "title": "考核点", "content": ["具备对信息、数字、资讯的敏感度。", "能过滤无用、錯誤信息，不被其所干扰。", "理解报表信息，并掌握数据分析思维，对现状进行分析。"] },
                            { "title": "能力解讀", "content": ["您還需要花更多的精力，完善自己在报表与数据解读上的能力，透过科学化的分析，能使您在部署战略上，了解全局现状，洞察问题关键，预判发展趋势。從數據中你將收穫宏觀的視野,掌握全局。", ] }

                        ]
                    }, {
                        "title": "市场洞察力",
                        "level": "A",
                        "desc": [
                            { "title": "考核点", "content": ["是否考虑到针对目标制定不同的销售计划。", "合理分配、调整指标的设定。", "透过多元的资源分配，达成销售目的。"] },
                            { "title": "能力解讀", "content": ["能够發現潜在的市場因素變化，洞察市場規律，并带领团队快速响应，做出精彩的解决方案。在多變的市場環境中，你將有十方亮眼的表現。", ] }

                        ]
                    }, {
                        "title": "目标分级能力",
                        "level": "S",
                        "desc": [
                            { "title": "考核点", "content": ["科学有效的将目标进行分级。", "挖掘、发现、关注重点医院。", "發现业务上的突破口与增长点。"] },
                            { "title": "能力解讀", "content": ["选定正确的销售目标，是成功的第一步，您已完美掌握区分目标重点医院的關鍵要領，并正确的将医院进行分级，如此出色的能力，可见您是个善于发觉的重点的目标打击者。", ] }

                        ]
                    }]
                }]
            }, {
                "id": "yewufazhan",
                "component_data": [{
                    "key": "evaluation-title-card",
                    "values": {
                        "title": "业务发展",
                        "content": "业务发展是关于具体区域规划中的策略部分，也就是我们常说的销售力，首先经理的角色，是组织贯彻战略的核心，您将是公司战略规划落地执行的关键先生。因此，您需更多理解指标背后所代表的公司整体布局，并透过您对于自身区域的理解与规划，针对每个目标客户做出有针对性的销售计划，同时，考量资源分配与效益问题，做出良好的权衡，使自己的工作能有效的贯策公司全体战略目标，与组织同步前进。"
                    }
                }, {
                    "key": "ability-card",
                    "values": [{
                        "title": "公司战略执行力",
                        "level": "B",
                        "desc": [
                            { "title": "考核点", "content": ["是否理解、达成上层下达的战略目标、並達成要求。", "能深度剖析目标的含义，并将目标拆分与分解。", "结合自身業務場景，做出完整、合宜的计划调整。"] },
                            { "title": "能力解讀", "content": ["一定程度理解上層下達的戰略目標。但需要更深入的去剖析，並思考在自身的銷售工作中，該如何去完成。", ] }

                        ]
                    }, {
                        "title": "资源分配与优化",
                        "level": "A",
                        "desc": [
                            { "title": "考核点", "content": ["是否考虑到针对目标制定不同的销售计划。", "合理分配、调整指标的设定。", "透过多元的资源分配，达成销售目的。"] },
                            { "title": "能力解讀", "content": ["能够發現潜在的市場因素變化，洞察市場規律，并带领团队快速响应，做出精彩的解决方案。在多變的市場環境中，你將有十方亮眼的表現。", ] }

                        ]
                    }, {
                        "title": "目标分级能力",
                        "level": "S",
                        "desc": [
                            { "title": "考核点", "content": ["科学有效的将目标进行分级。", "挖掘、发现、关注重点医院。", "發现业务上的突破口与增长点。"] },
                            { "title": "能力解讀", "content": ["选定正确的销售目标，是成功的第一步，您已完美掌握区分目标重点医院的關鍵要領，并正确的将医院进行分级，如此出色的能力，可见您是个善于发觉的重点的目标打击者。", ] }

                        ]
                    }]
                }]
            },
            {
                "id": "other",
                "component_data": [{
                    "key": "evaluation-title-card",
                    "values": {
                        "title": "业务发展",
                        "content": "业务发展是关于具体区域规划中的策略部分，也就是我们常说的销售力，首先经理的角色，是组织贯彻战略的核心，您将是公司战略规划落地执行的关键先生。因此，您需更多理解指标背后所代表的公司整体布局，并透过您对于自身区域的理解与规划，针对每个目标客户做出有针对性的销售计划，同时，考量资源分配与效益问题，做出良好的权衡，使自己的工作能有效的贯策公司全体战略目标，与组织同步前进。"
                    }
                }, {
                    "key": "ability-card",
                    "values": [{
                        "title": "公司战略执行力",
                        "level": "B",
                        "desc": [
                            { "title": "考核点", "content": ["是否理解、达成上层下达的战略目标、並達成要求。", "能深度剖析目标的含义，并将目标拆分与分解。", "结合自身業務場景，做出完整、合宜的计划调整。"] },
                            { "title": "能力解讀", "content": ["一定程度理解上層下達的戰略目標。但需要更深入的去剖析，並思考在自身的銷售工作中，該如何去完成。", ] }

                        ]
                    }, {
                        "title": "资源分配与优化",
                        "level": "A",
                        "desc": [
                            { "title": "考核点", "content": ["是否考虑到针对目标制定不同的销售计划。", "合理分配、调整指标的设定。", "透过多元的资源分配，达成销售目的。"] },
                            { "title": "能力解讀", "content": ["能够發現潜在的市場因素變化，洞察市場規律，并带领团队快速响应，做出精彩的解决方案。在多變的市場環境中，你將有十方亮眼的表現。", ] }

                        ]
                    }, {
                        "title": "目标分级能力",
                        "level": "S",
                        "desc": [
                            { "title": "考核点", "content": ["科学有效的将目标进行分级。", "挖掘、发现、关注重点医院。", "發现业务上的突破口与增长点。"] },
                            { "title": "能力解讀", "content": ["选定正确的销售目标，是成功的第一步，您已完美掌握区分目标重点医院的關鍵要領，并正确的将医院进行分级，如此出色的能力，可见您是个善于发觉的重点的目标打击者。", ] }

                        ]
                    }]
                }]
            }
        ]
    }
});